% -------------------------------
% تنفيذات أول مختبر أمنية شبكات - أساسيات فقط
% -------------------------------
clc;
clear;

% دالة لقراءة الصورة imread نعطيها الصورة وامتدادها مثل
I = imread('cameraman.tif');
% أو المسار كامل مع اسم الصورة والامتداد مثل:
% I = imread('C:\4th st\THE PROJECT\Front-end\public\logo192.png');
% imshow(I); % لعرض الصورة الي قريناها

% imwrite(I, 'filename.png') % لإنشاء صورة جديدة مأخوذة قيمتها من المصفوفة I واسمها يكون الي حددناه بين علامات ومرات لازم الامتداد همين

% هنا نقرأ معلومات صورة ونخلي المعلومات في متغير اسمه k
k = imfinfo('C:\4th st\OUR PROJECT\THE PROJECT\Front-end\event-management 06.01.2025\public\logo192.png');
disp(k); %نعرض المعلومات هنا


x = k.Width % ناخذ عرض الصورة ونخليه في متغير x

y = k.Height  % ناخذ طول الصورة ونخليه في متغير y

% J = imresize(I, 0.5); %نغير حجم الصورة نخليها بنص الحجم 0.5 يعني 5 بالمئة

J = imresize(I, [200, 200]); %نغير حجم الصورة لكن بتحديد الطول والعرض
% imshow(J); % نعرض الصورة 

Q = imnoise(I, 'salt & pepper', 0.5); % نسوي تشويش على الصورة باستخدام فلتر جاهز اسمه 'salt & pepper'


% imshow(Q); % نعرض الصورة المشوشة

subplot(1,2,1) % نسوي ترتيب للعرض مال الصور على الشاشة
imshowpair( Q, I, 'montage'); % نعرض صورتين سوا وحدة يم الثانية

subplot(1,2,2)
imshow(Q);


% W = rgb2gray(Q) % نحول الصورة الملونة إلى رمادية
% imshow(W) % نعرض الصورة بعد ما صارت رمادية
